In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series

# lambda

In [3]:
f = lambda x, y: x + y
f(1, 4)

5

In [4]:
def f(x, y):
    return x + y

In [5]:
f = lambda x: x ** 2
f(3)

9

In [6]:
f = lambda x: x + 5
f(3)

8

In [7]:
(lambda x: x + 1)(5)

6

# map & replace

### map for series


- pandas의 series type의 데이터에도 map 함수 사용가능
- function 대신 dict, sequence형 자료등으로 대체 가능

In [8]:
ex = [1, 2, 3, 4, 5]
f = lambda x: x ** 2
list(map(f, ex))

[1, 4, 9, 16, 25]

In [9]:
f = lambda x, y: x + y
list(map(f, ex, ex))

[2, 4, 6, 8, 10]

In [10]:
list(map(lambda x: x + 5, ex))
# python 3에는 list를 꼭 붙여줘야함

[6, 7, 8, 9, 10]

In [11]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [12]:
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [13]:
# f = lambda x: x**2
def f(x):
    return x + 5


s1.map(f)

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

In [14]:
s1  # s1 변화 없음, 바꾸고 싶으면inplace 써줘야함

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [15]:
z = {1: "A", 2: "B", 3: "C"}  # dict type으로 데이터 교체
s1.map(z)  # 없는 값은 NaN

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [15]:
s2 = Series(np.arange(10, 30))
s1.map(s2)  # 같은 위치의 데이터를 s2로 전환

# np.arange(10, 30)은 훨씬 많지만
# index가 9까지이기 때문에 9까지만 mapping 해준다
# 즉, index 기준 mapping!

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [16]:
!wget https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv

--2021-01-27 12:14:35--  https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.76.133
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.76.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 62250 (61K) [text/plain]
Saving to: ‘wages.csv.1’

wages.csv.1         100%[===================>]  60.79K  --.-KB/s    in 0.1s

2021-01-27 12:14:37 (511 KB/s) - ‘wages.csv.1’ saved [62250/62250]

In [18]:
df = pd.read_csv("./wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [19]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [20]:
def change_sex(x):
    return 0 if x == "male" else 1


df.sex.map(change_sex)

0       0
1       1
2       1
3       1
4       1
       ..
1374    0
1375    1
1376    1
1377    0
1378    0
Name: sex, Length: 1379, dtype: int64

In [22]:
df  # not in-place!

              earn  height     sex   race  ed  age
0     79571.299011   73.89    male  white  16   49
1     96396.988643   66.23  female  white  16   62
2     48710.666947   63.77  female  white  16   33
3     80478.096153   63.22  female  other  16   95
4     82089.345498   63.08  female  white  17   43
...            ...     ...     ...    ...  ..  ...
1374  30173.380363   71.68    male  white  12   33
1375  24853.519514   61.31  female  white  18   86
1376  13710.671312   63.64  female  white  12   37
1377  95426.014410   71.65    male  white  12   54
1378   9575.461857   68.22    male  white  12   31

[1379 rows x 6 columns]

In [23]:
# 성별 str -> 성별 code(int)
df["sex_code"] = df.sex.map({"male": 0, "female": 1})  # dict
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

### replace function

- Map 함수의 기능 중 데이터 변환 기능만 담당
- 데이터 변환시 많이 사용하는 함수

In [39]:
df.sex.replace({"male": 0, "female": 1})  # dict type 적용

0       0
1       1
2       1
3       1
4       1
       ..
1374    0
1375    1
1376    1
1377    0
1378    0
Name: sex, Length: 1379, dtype: int64

In [26]:
df.sex.head(5)  # not in-place!

0      male
1    female
2    female
3    female
4    female
Name: sex, dtype: object

In [27]:
df.sex.replace(["male", "female"], [0, 1], inplace=True)

# ["male", "female"] -> target list
# [0, 1] -> conversion list
# "male"을 0으로, "female"을 1으로 바꾼다

In [28]:
df

              earn  height  sex   race  ed  age  sex_code
0     79571.299011   73.89    0  white  16   49         0
1     96396.988643   66.23    1  white  16   62         1
2     48710.666947   63.77    1  white  16   33         1
3     80478.096153   63.22    1  other  16   95         1
4     82089.345498   63.08    1  white  17   43         1
...            ...     ...  ...    ...  ..  ...       ...
1374  30173.380363   71.68    0  white  12   33         0
1375  24853.519514   61.31    1  white  18   86         1
1376  13710.671312   63.64    1  white  12   37         1
1377  95426.014410   71.65    0  white  12   54         0
1378   9575.461857   68.22    0  white  12   31         0

[1379 rows x 7 columns]

In [25]:
del df["sex_code"]

In [26]:
df.head()

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

# apply & applymap

### apply

- map과 달리, series 전체(column)에 해당 함수를 적용
- 입력 값이 series 데이터로 입력받아 handling 가능
- 통계치 낼 때 많이 사용

In [29]:
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [30]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [31]:
f = lambda x: np.mean(x)
df_info.apply(f)  # 각 cloumn 별로 결과값 반환

earn      32446.292622
height       66.592640
age          45.328499
dtype: float64

In [32]:
df_info.apply(np.mean)  # column 단위

earn      32446.292622
height       66.592640
age          45.328499
dtype: float64

In [42]:
# 내장 연산 함수를 사용해도 똑같은 효과
# mean, std 등 사용 가능

print(df_info.sum(), "\n")
print(df_info.apply(sum))

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [33]:
df_info.mean()

earn      32446.292622
height       66.592640
age          45.328499
dtype: float64

In [35]:
# scalar 값 이외에 Series값의 반환도 가능

def f(x):
    return Series(
        [x.min(), x.max(), x.mean(), sum(x.isnull())],
        index=["min", "max", "mean", "null"],
    )


df_info.apply(f)  # column 단위 통계치 가능

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.127955  77.21000  95.000000
mean   32446.292622  66.59264  45.328499
null       0.000000   0.00000   0.000000

### applymap for dataframe

- series 단위가 아닌 element 단위로 함수를 적용함
- series 단위에 apply를 적용시킬 때와 같은 효과
- transform에서 사용
- 즉, 모든 값에 적용된다

In [44]:
df_info.head(5)

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [45]:
f = lambda x: x // 2
df_info.applymap(f).head(5)  # applymap - 모든 값에 적용

      earn  height  age
0  39785.0    36.0   24
1  48198.0    33.0   31
2  24355.0    31.0   16
3  40239.0    31.0   47
4  41044.0    31.0   21

In [47]:
f = lambda x: x // 2
df_info["earn"].apply(f).head(5)  # apply를 series 단위로 적용하면 map과 같은 효과

0    39785.0
1    48198.0
2    24355.0
3    40239.0
4    41044.0
Name: earn, dtype: float64